In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [4]:
ser1 = Series([0,1,2],index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [6]:
ser2 = Series([3,4,5,6],index=['A','B','C','D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [8]:
ser1+ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [12]:
dframe1 = DataFrame(np.arange(4).reshape(2,2),columns=list('AB'),index=['NYX','THOR'])
dframe1

      A  B
NYX   0  1
THOR  2  3

In [16]:
dframe2 = DataFrame(np.arange(9).reshape(3,3),columns=list('ADC'),index=['NYX','THOR','GAIA'])
dframe2

      A  D  C
NYX   0  1  2
THOR  3  4  5
GAIA  6  7  8

In [18]:
dframe1 + dframe2

        A   B   C   D
GAIA  NaN NaN NaN NaN
NYX   0.0 NaN NaN NaN
THOR  5.0 NaN NaN NaN

In [20]:
dframe1

      A  B
NYX   0  1
THOR  2  3

In [22]:
dframe1.add(dframe2,fill_value=0)

        A    B    C    D
GAIA  6.0  NaN  8.0  7.0
NYX   0.0  1.0  2.0  1.0
THOR  5.0  3.0  5.0  4.0

In [24]:
dframe2

      A  D  C
NYX   0  1  2
THOR  3  4  5
GAIA  6  7  8

In [30]:
ser3 = dframe2.iloc[0]
ser3

A    0
D    1
C    2
Name: NYX, dtype: int32

In [32]:
dframe2-ser3

      A  D  C
NYX   0  0  0
THOR  3  3  3
GAIA  6  6  6